# p.315
# 조건:한사람만 앉는 테이블 없게 그룹화 
앉힐수있는최소사람수 = 2
앉힐수있는최대사람수 = 10
전체사람의수 = 100
memo = {}

def 문제(남은사람수, 최소사람수):
    key = str([남은사람수,최소사람수]) 

    if key in memo:
        return memo[key]
    if 남은사람수 < 0:
        return 0
    if 남은사람수 == 0:
        return 1
    
    경우의수 = 0
    # 재귀
    for 테이블인원 in range(최소사람수, 앉힐수있는최대사람수+1):  # (2 , 11 ) 2 3 4 5 6 .. 10 
        경우의수 += 문제(남은사람수-테이블인원, 테이블인원) #  테이블 인운 2일떄, 문제( 98, 2 ) -> (96, 2) ... _> (0 ,2)
    
    # 메모화
    memo[key] = 경우의수
    #종료
    return 경우의수
print( 문제(전체사람의수,앉힐수있는최소사람수) )